[
  {
    "title":"Introducing python-in-browser",
    "body":"Python-in-browser is a project I have been working on which allows you to run Python code in your browser, sandboxed away from your system.\n \nI was inspired by https://github.com/raxod502/python-in-a-box, but python-in-browser has very few things in common. \nPython-in-a-box runs Python code on a server, so it has access to most of the good Python featues.\nPython-in-browser parses Python code in your browser, so it lacks most of those features. \nThe only good thing about Python-in-browser is the fact that it sends no requests to a server, so it works offline. (to some degree, and the page must be loaded with an internet connection)\nPython-in-browser can be found at https://iam-py-test.github.io/python-in-browser, and the source code is at https://github.com/iam-py-test/python-in-browser"
  },
  {
    "title":"Why should you use NoScript?",
    "workinprogress":true,
    "hidden":true,
    "body":"NoScript is a browser extention which allows you to selectivly allow or deny scripts. NoScript also provides protection against XSS (see https://en.wikipedia.org/wiki/xss), but I have never seen it block a real attack. \nHowever, its XSS protection was able to block all of the XSS tests I knew and all of the OWASP advanced ones I tested. "
  },
  {
    "title":"Tracking down fake Firefoxs",
    "workinprogress":true,
    "hidden":true,
    "body":"The first results on a quick search 'Download firefox' are from Mozilla's website, but if you scroll down, there are a few other results that are not. \nSome of them seem legit, but others are a bit more suspicious. I clicked on the 9th result, and immediately it was blocked by the Blocklist Project malware (found here - https://raw.githubusercontent.com/blocklistproject/Lists/master/malware.txt) due to its root domain.\nVirusTotal shows three detections for it, but the root domain had 4 and a poor community rating. A comment from 5 years ago says \"It's just a breeding ground for viruses! \".\nNorton's community reports are all from 9 or more years ago, and is rated poorly.\nFinally, MyWOT has one community rating from 6 years ago that marks it as low trust, and the icon at the top is orange.\nAll the files from the domain were clean according to VT, but their SHA-256s are diffrent from the offical Firefox downloader. Consitering the signature is from Mozilla, it seems legit.\n If someone knows anything about this domain, please reach out to me via https://github.com/iam-py-test/my_filters_001/issues.\nUntil more information is known, I will not blocklist this domain.\nDomains: mozilla-firefox[.]apponic[.]com\nmozilla-firefox-64-bit[.]apponic[.]com\nSHA-256:\n0ba46a3bda93f50a567887e2c6df97663bf290352654dbf103236d3f6ab0bfab"
  },
  {
    "title":"How to fix VirtualBox error 0x80004005",
    "body":"If you have updated VirtualBox lately, you might have noticed that whenever you try to start a VM - even a new one - you get an error with the code 0x80004005.\nBut don't worry; your VMs are safe. There is a simple fix.\nAll you need to do is download version 6.1.26 from https://www.virtualbox.org/wiki/Download_Old_Builds_6_1 and install it.\nAfter that, you will get alerts telling you to update, but until it is fixed, you should ignore them.\nSmall note: While I was trying to fix this, I ran across a lot of weird 'fixes' which said to delete random folders, so be careful when looking for fixes.\nFor more information, please see https://forums.virtualbox.org/viewtopic.php?t=104228."
  }
  ]
