[
  {
    "title":"Introducing python-in-browser",
    "body":"Python-in-browser is a project I have been working on which allows you to run Python code in your browser, sandboxed away from your system.\n \nI was inspired by https://github.com/raxod502/python-in-a-box, but python-in-browser has very few things in common. \nPython-in-a-box runs Python code on a server, so it has access to most of the good Python featues.\nPython-in-browser parses Python code in your browser, so it lacks most of those features. \nThe only good thing about Python-in-browser is the fact that it sends no requests to a server, so it works offline. (to some degree, and the page must be loaded with an internet connection)\nPython-in-browser can be found at https://iam-py-test.github.io/python-in-browser, and the source code is at https://github.com/iam-py-test/python-in-browser\n[img]code.jpeg[/img]"
  },
  {
    "title":"Why should you use NoScript?",
    "workinprogress":true,
    "hidden":true,
    "body":"NoScript is a browser extention which allows you to selectivly allow or deny scripts. NoScript also provides protection against XSS (see https://en.wikipedia.org/wiki/xss), but I have never seen it block a real attack. \nHowever, its XSS protection was able to block all of the XSS tests I knew and all of the OWASP advanced ones I tested. "
  },
  {
    "title":"Tracking down fake Firefoxs",
    "workinprogress":true,
    "hidden":true,
    "body":"The first results on a quick search 'Download firefox' are from Mozilla's website, but if you scroll down, there are a few other results that are not. \nSome of them seem legit, but others are a bit more suspicious. I clicked on the 9th result, and immediately it was blocked by the Blocklist Project malware (found here - https://raw.githubusercontent.com/blocklistproject/Lists/master/malware.txt) due to its root domain.\nVirusTotal shows three detections for it, but the root domain had 4 and a poor community rating. A comment from 5 years ago says \"It's just a breeding ground for viruses! \".\nNorton's community reports are all from 9 or more years ago, and is rated poorly.\nFinally, MyWOT has one community rating from 6 years ago that marks it as low trust, and the icon at the top is orange.\nAll the files from the domain were clean according to VT, but their SHA-256s are diffrent from the offical Firefox downloader. Consitering the signature is from Mozilla, it seems legit.\n If someone knows anything about this domain, please reach out to me via https://github.com/iam-py-test/my_filters_001/issues.\nUntil more information is known, I will not blocklist this domain.\nDomains: mozilla-firefox[.]apponic[.]com\nmozilla-firefox-64-bit[.]apponic[.]com\nSHA-256:\n0ba46a3bda93f50a567887e2c6df97663bf290352654dbf103236d3f6ab0bfab"
  },
  {
    "title":"Don't enable Macros; they can infect your computer",
    "hidden":true,
    "body":"Microsoft Office macros are being abused to infect peoples computers with malware; the Dridex malware is spread primarly throught this, and this attack has been used many other times. Not all Macros are bad; many people use Macros for legit uses, and this makes fighting Macro viruses even harder.\nPlus, Macro viruses are hard to detect by antivirus scanners (1), and manual analysis is not a viable option.\nThe real responsibility for preventing this type of malware falls to Microsoft, who (as of May 17th) has failed to patch this. \nTo my knowlage, this exploit only effects Windows.\n\nWhat can you do about this:\n1. Do not open attachments from strange emails\n2. Do not enable Macros in emails or from other devices\nWhile you may think it is ok to run Macros from a trusted source, they could be infected (some people have been infected via emails from trusted sources) or the address could have been spoofed.\n3. Install an antivirus (even on MacOS)\nWhile antivirus software is not perfect, it can stop malware infections. I recommend https://malwarebytes.com, but any good antivirus should do. \nHowever, make sure your antivirus uses heuristics. Personally, I recommend against using McAfee.\n4. Keep your system and all software up-to-date\nThis is important, as security patches and antivirus updates can eliminate malware.\nNormally new Macro virus are detected soon, as the malware reported to https://www.joesandbox.com/analysis/413824/0/html now has 35 detections (https://www.virustotal.com/gui/file/692868392ecf930f456d9387ee6132eac61cc07913e668fe6af575f16fbb2392/detection)\n5. Don't use Windows\nThis exploit, and a lot of other malware, primarly or only attacks Windows. Even if you are using a secure OS, you still should follow the above steps.\n6. If you think you have been infected, immediately disconnect from the internet and (if possible) manually disable the router. \nThen run an antimalware scan on your device and all devices on that network. \nIf you think you were infected by an email from someone you trust, tell them to scan their system for malware.\nOn Windows, I recommend you scan using your antivirus and Windows Defender (full and offline scans). \nAlso download (via another computer if possible) Malwarebytes free (here - https://www.malwarebytes.com/), ADWCleaner (here - https://www.malwarebytes.com/adwcleaner), Malwarebytes antirootkit (beta) (here - https://www.malwarebytes.com/antirootkit), and Hitman Pro (here - https://secure2.sophos.com/en-us/products/free-tools/hitmanpro.aspx).\nLinks to more information:\nhttps://www.fortinet.com/blog/threat-research/hundreds-of-urls-inside-microsoft-excel-spreads-new-dridex-trojan-variant \nhttps://en.wikipedia.org/wiki/Macro_virus\nhttps://iam-py-test.github.io/security_research/reports.html#report-Exploit:Win64/msoffice.malwaredownload\n"
  },
  {
    "title":"Testing McAfee WebAdvisor, Norton LifeLock, and FortiGuard against malware",
    "hidden":true,
    "body":"McAfee WebAdvisor, Norton LifeLock, and FortiGuard all have malware website detection systems, so I decided to test them out against a bunch of malware domains to figure out which is best.\nI am getting these domains from URLHaus and from my personal antimalware filter. I will put the links at the end of this post.\n\nI will be testing 10 domains from each, starting at the top.\n\nOur first domain gets a Malware rating from McAfee and FortiGuard, and Caution rating from Nortron.\n\nNumber 7 was our first miss; FortiGuard failed to detect it, while Norton and McAfee detected it as Caution.\n\nThe first part showed that Norton rated all but one as Caution, and McAfee rated 4 as caution. FortiGuard was the only one to have a miss.On to the second test. \n\nOur first domain from my list is a miss for all. However, the first domain was a domain which had fallen into malware hands and used to be ok. \nConsitering FortiGuard's rating was from 2010 and the Norton community reports (all good) are from 10-11 years ago, these reports are just outdated. Still not great.\n\nThe next domain, however, was 2/3 with FortiGuard marking as Domain Parking, and the next was back to all avs. \n\nNumbers 4 & 5 are dead domaisn, so I am skiping them\n\n 6 was a flop, with all avs detecting it as safe. Note that 6 is a well known - and still online - scam domain.\n\n7 was missed by Norton, which is weird consitering the 7 av detections on VirusTotal and domain-level block by uBlock Origin.\n\nI am skiping to number 11 becuase it is more interesting.\nAll detect it, and Norton has one community report. Not supprising though. The weird part is that McAfee claims the domain is parked (it is not) but detects it anyway.\n12 is a major phishing domain, but still gets caution from Norton. I wonder what Caution really means...\n13 is weird; Norton gives it a big red DANGER, but FortiGuard and McAfee don't. To make things weirder, FortiGuard's detection log shows it should be detected, but it is not.\nAt the end, out of 20, McAfee detected 17, FortiGuard detected 15, and Norton detected 17. This leaves Norton and McAfee tied, and FortiGuard left behind. \nOver all, that is not what I expected. I expected Norton and FortiGuard to be at the top, and McAfee to have more misses. \n \nDue to the low sample size, I am going to test 6 more domains from The BlockList Project's ransomware domains list.\nResults: McAfee and Norton detected everything, and FortiGuard only detected two. This is very intresting; these domains are not just your garden variety malware; all of these domain are known ransomware. These stats show that FortiGuard has poorer detection then Norton and McAfee.\nLater, I plan on automatting the test and testing far more domains, as to get a better look at what these AVs detect and miss. I also may test domains against other tools.\n Till then, stay safe!\n\n\nLinks:\nFortiGuard: https://www.fortiguard.com/webfilter?q=example.com&version=8\nMcAfee (will need to type the domain into the url bar): https://www.siteadvisor.com/sitereport.html?url=example.com\nNorton: https://safeweb.norton.com/report/show?url=example.com\n\nTest lists:\nURLHaus: https://curben.gitlab.io/malware-filter/urlhaus-filter-online.txt\nMy list: https://github.com/iam-py-test/my_filters_001/blob/main/Alternative%20list%20formats/antimalware_domains.txt\nBlock List Project ransomware: https://raw.githubusercontent.com/blocklistproject/Lists/master/ransomware.txt "
  },
  {
    "title":"Testing Google Safe Browsing vs malware and phishing",
    "hidden":true,
    "body":"Google Safe Browsing is the default protection in many browsers, including Chrome and Firefox.\nAs like my previous post, we are testing Google Safe Browsing against domains from URLHaus (here - https://curben.gitlab.io/malware-filter/urlhaus-filter-online.txt) and Phishing Filter (here - https://raw.githubusercontent.com/curbengh/phishing-filter/master/dist/phishing-filter.txt). \nI will test 11 domains from each. \nThe very first domain in URLHaus was missed by Google, but number 2 was detected.\nFor the malware filter, only one was detected. On to the phishing filter...\nOn the phishing filter, number 2 was detected, as well as three. Number 5 has a warning, stating that some pages are harmful. Numbers 9 and 10 were detected, but 8 was not.\nJust for reference, I tested numbers 8,9, 10, and 11 against McAfee, and it detected all of them. \n\nTotal Detected: 5/22\n\nThese detections show that Google Safe Browsing can detect some domains, but that on its own, it is not sufficent protection.\nAlso consitering it is the default in many browsers, by the time a site is detected by it, it has pretty much met its end.\n\nStay safe everyone!"
  },
  {
    "title":"Testing antiviruses vs malware, phishing, and PUPs",
    "hidden":true,
    "body":"My last two blog posts have been testing McAfee, Norton, FortiGuard, and Google vs malware and phishing, along with scams and spam. \nHowever, those tests were not great, due to small sample size.\nSo today, we are testing Google Safe Browsing, McAfee SiteAdvisor, Norton LifeLock, FortiGuard web filter, and Yandex Safe Browsing against a bunch of domains. \nFirst I will use 15 domains from the URLHaus filter list (here - https://curben.gitlab.io/malware-filter/urlhaus-filter.txt).\nOur very first domain was missed by both Google and Yandex, while it was detected by Norton, FortiGuard, and McAfee, and number two was missed by Google, Yandex, and FortiGuard. Things get worse, as 4 was missed by everyone except Norton.\nI should note that Yandex keeps locking me out & asking if I am a bot.\nAt the end of this part, we have none detected by Google and Yandex, 12 detected by McAfee, 6 detected by FortiGuard, and everything detected by Norton. On to the PUPs.\n\nOn the PUP test, we noticed a lot of misses even from Norton, who got a high score in the malware test.\nScore: McAfee: 1 Norton: 8 FortiGuard: 5 Google: 3 \nOn the phishing test, we have 15 detections from McAfee, who missed no samples. Norton fell behind with only 13 detections, and also kept malfunctioning. Yandex missed everything, while Google Safe Browsing saw probably its best yet, with 10 detections. FortiGuard is tied with Norton at 13 detections.\n\nThe final score shows Norton in the lead with 36 detections. McAfee in second with 28, and FortiGuard in 3rd with 24. Google ends in 4th with 13 detections, mostly from the Phishing test. Yandex ends with no detections, leaving it sadly in 5th place. \n\nIf this test is correct, Norton is the best at detecting malware (100% detection), PUPs, and phishing. If you want to see the Norton antivirus fighting real malware files, see https://www.youtube.com/watch?v=A3GeqSR2UeI. \n\nNo matter which you use, you will see misses, as even Norton and McAfee faired poorly on the PUP test, and missed Malware and Phishing as well. \nIf you want some of the protection of Norton without paying or even installing, you can copy and paste urls into the Enter Site bar on https://safeweb.norton.com. \nI have uploaded the raw test results to https://iam-py-test.github.io/friendly-waddle/files/test_results.txt. If you see any errors, please open an issue in https://github.com/iam-py-test/friendly-waddle and I will try to correct it.\n I hope this was informative and will help you chose which AV to use. Stay safe!"
  },
  {
    "title":"Testing Sucuri SiteCheck vs ransomware and malware",
    "hidden":true,
    "body":"Sucuri SiteCheck is a tool which allows people to scan sites for malware and site issues, and check the site against common blocklists. It mainly exists to sell Sucuri's website cleanup tool, however, it does have some real malware detection, and we are testing that today. I am ignoring the 3rd party blocklists and just focusing on Sucuri's blocklist and malware detection.\nI am using URLHaus (here - https://curben.gitlab.io/malware-filter/urlhaus-filter.txt) and BlockList Project ransomware list. (here - https://raw.githubusercontent.com/blocklistproject/Lists/master/ransomware.txt). Let the testing begin.\n\nIn the first test, we only had one detection, leaving it at 1/15. Onto the ransomware...\nOn the ransomware test, we get a 0/15 rating. This is so low detection, I am going to run 5 domains from PUP-filter (https://curben.gitlab.io/malware-filter/pup-filter.txt) through it.\nOn the PUP-filter, it is missing things that Google detected, and got 0/5. \nOverall rating is 1/35, which is low even for Google Safe Browsing (who got 5 out of far fewer). This puts Sucuri only one above Yandex, who failed to detect anything.\nStay safe!"
  },
  {
    "title":"Testing MyWOT - can it really block malware?",
    "hidden":true,
    "body":"MyWOT is a website which allows people to see if a site is safe. \nThey have been caught stealing user data, however, that issue only affected the extension. Today we are going to test how well it does, and if the long standing belief on VirusTotal that the rating system does not work is true.\n\nI am testing it using URLHaus (https://curben.gitlab.io/malware-filter/urlhaus-filter.txt), PUP-filter (https://curben.gitlab.io/malware-filter/pup-filter.txt), Phishing filter (https://curben.gitlab.io/malware-filter/phishing-filter.txt), BlocklistProject ransomware, along with some scams and PUPs I have collected.\n\nOn the malware test, we get a rating of 1/15. On the PUP test, we get nothing detected, which is odd. \nOn the phishing test, we get no detections either. Even the ransomware test gets no detections.\n\nAs it detected only 1/60, I am moving onto the scam and PUP domains I collected.\n\n Our first  domain (and the second) has a weird bug weird; the overall score is good, but all the community reports are bad. \n\nWe get a 3/10 on that test. One thing I learned is that the overall rating is wrong, and some sites are even rated without any community reports. \n\nSee https://iam-py-test.github.io/friendly-waddle/files/mywot.txt for a full report. Stay safe!"
  },
  {
    "title":"Norton vs McAfee",
    "hidden":true,
    "body":"In my past tests, Norton and McAfee have scored the highest, in one they even tied. Today I have retested them against some old ransomware, and then against some new threats I collected over the last 24 hours.\nThe results show that both did excellent against old threats, but neither was able to detect all the new threats.\n\nThe result was 15/26 for Norton and 17/26 for McAfee, which puts McAfee in the lead. \nThe domains used are at https://gist.github.com/iam-py-test/287f7c624d5a7a91386e98ad1fce0d61#file-wild_domains_20-7-2021-txt and the test results are at https://gist.github.com/iam-py-test/287f7c624d5a7a91386e98ad1fce0d61#file-norton__mcafee_detection-txt.\nStay safe!"
  },
  {
  "title":"Beware of fake Windows alerts",
    "body":"Fake antivirus alerts have been around for a while, but consitering they keep poping up, some people sadly keep falling for them. \nThe purpose of this blog post is not to shame people who fall for these alerts, but to alert everyone of this threat.\nSome indicators of a scam are:\n- The alert is for an antivirus you don't use (i.e. it is for Norton, but you use McAfee)\n- The alert is for the wrong OS (i.e. Windows Defender alerts on a Mac)\n- The alert tells you to call a phone number (real AVs like Windows Defender, Malwarebytes, and Norton will only require a button click, or sometimes a UAC (user account control - Windows only), and many do it automatically. The most required is a reboot, and if it still can't remove it, then it will probably send you to its website.\n- Small errors, like a 'no action needed' status just above a warning, or part of an green icon showing. These can be hard to spot, and some scammers might fix them.\nWhile some of these scams have easy flaws, it is easy to still fall for these if you are in a hurry, and these steps are not scammerproof.\nIf you or someone you know falls for a scam like this, it is not their falt. The best defense is up-to-date antimalware protection. \nAs always, stay safe everyone!"
  },
  {
    "title":"Malwarebytes VS PUPs",
    "hidden":true,
    "body":"Today I am testing Malwarebytes vs PUPs. I originally was going to run 16 PUPs on a test system protected by Malwarebytes, but once it decided to end my free trial, I had to switch to just scanning the folder.\nThere are 16 PUPs in the folder, most of which are pretty well known.\nThe end result was 10/16, which is not great...\nMost of these have been blocked on execution or later in the install, but this still shows not a very good signature-based detection. Weirdly, it even missed TotalAV, which is a well known & old PUP.\nHopefully next time I will be able to test the full real time protection. Stay safe everyone!"
  },
  {
    "title":"New testing method + retest of Norton",
    "hidden":true,
    "body":"After my previous tests, I have implemented a new test method; First, I will test 20 domains from, URLHaus's Online Domains version (here - https://curben.gitlab.io/malware-filter/urlhaus-filter-domains-online.txt), PUP-filter (here - https://curben.gitlab.io/malware-filter/pup-filter.txt), and Phishing URL Blocklist (here - https://curben.gitlab.io/malware-filter/phishing-filter.txt), 25 domains from @BlocklistProject's ransomware list (here - https://raw.githubusercontent.com/blocklistproject/Lists/master/ransomware.txt), and 15 domains which I collected over the last 24 hours. \nThe first part of the test is mainly to just see how well the AV does against various threats.\nThe second part is to test how well the AV does at detecting fairly well known, dangerous, threats. I expect 90-100% detection on this section.\nThe final section should be newer threats, and aims to test if the AV is able to quickly find & rate newer threats.\n\nOn this, Norton scored 73% on the first part (18/20 on malware, 13/20 on PUPs, and 13/20 on Phishing). \nOn the second part, Norton detected all the threats, and on the last part, Norton detected 13 out of 15 threats.\nThe overall score for Norton was 82%, but we will not be able to have a complete picure until I test other AVs using the same method\nThe full results are at https://gist.github.com/iam-py-test/91a4d801ce1b0a044734c50bcd4ebfca. Stay safe!"
  },
  {
    "title":"Malwarebytes + malware = bytes?",
    "hidden":true,
    "body":"Malwarebytes browser guard is a free browser extension for blocking trackers, malware, and phishing which you can install from the Mozilla or Chrome webstores. But how good is it? Using 20 of the latest malware and phishing links from both VXVault and PhishTank, I tested Malwarebytes in a VM and it blocked all of the malware links, but missed 3 of the phishing links. It even let fake Netfix and Xfinity websites steal my (also fake) login details.\nThis - in my opinion - is not a great result, but also not horrible. \nTo be fair to Malwarebytes, this was with Microsoft Smartscreen disabled, and without the help of the Malwarebytes Premium app's firewall. Plus, the two missed links were missed by a lot of other antivirus tools according to VirusTotal\n\nIf you want to install it, it is at https://addons.mozilla.org/en-US/firefox/addon/malwarebytes/ (Firefox) and https://chrome.google.com/webstore/detail/malwarebytes-browser-guar/ihcjicgdanjaechkgeegckofjjedodee (Chrome, Edge, Opera). The full Malwarebytes (trial version) can be downloaded from https://malwarebytes.com/free \nThe only good result is that maybe some scammer somewhere is very confused about why ihatephish@fish.com is not a valid Netfix account. Stay safe!"
  }
  ]
