[
  {
    "title":"Introducing python-in-browser",
    "body":"Python-in-browser is a project I have been working on which allows you to run Python code in your browser, sandboxed away from your system.\n \nI was inspired by https://github.com/raxod502/python-in-a-box, but python-in-browser has very few things in common. \nPython-in-a-box runs Python code on a server, so it has access to most of the good Python featues.\nPython-in-browser parses Python code in your browser, so it lacks most of those features. \nThe only good thing about Python-in-browser is the fact that it sends no requests to a server, so it works offline. (to some degree, and the page must be loaded with an internet connection)\nPython-in-browser can be found at https://iam-py-test.github.io/python-in-browser, and the source code is at https://github.com/iam-py-test/python-in-browser"
  },
  {
    "title":"How to fix VirtualBox error 0x80004005",
    "body":"If you have updated VirtualBox lately, you might have noticed that whenever you try to start a VM - even a new one - you get an error with the code 0x80004005.\nBut don't worry; your VMs are safe. There is a simple fix.\nAll you need to do is download version 6.1.26 from https://www.virtualbox.org/wiki/Download_Old_Builds_6_1 and install it.\nAfter that, you will get alerts telling you to update, but until it is fixed, you should ignore them.\nNote that version 6.1.30 is affected\nSmall note: While I was trying to fix this, I ran across a lot of weird 'fixes' which said to delete random folders, so be careful when looking for fixes on the internet.\nFor more information, please see https://forums.virtualbox.org/viewtopic.php?t=104228.\nHope this fixes your issue!"
  },
  {
    "title":"Removal instructions for \"Discord Free Nitro - Free Discord Nitro 2021\" ",
    "body":"\"Discord Free Nitro - Free Discord Nitro 2021\" is a theme for Chromium browsers which appears to exist for the primary purpose of promoting a scam website which claims to give you Discord Nitro.\nWhile the theme does not seem harmful, you still may want to remove it.\n\nHow to remove it from Google Chrome\nTo remove this from Google Chrome, go to chrome://settings. In the sidebar, click Appearance.\nAt the top, it should say Theme. Click the \"Reset to default\" button next to that.\nYour browser should now be running the default theme.\nTo be sure it is completely removed, go under 'Security and privacy', click 'Clear browsing data'. Be sure all boxes except 'Cached images and files' are unchecked and 'Time range' is set to 'All time'.\n\nHow to remove it from Microsoft Edge:\nTo remove this theme from Microsoft Edge (and reset back the the default theme, where you can select a theme of your choice), go to edge://settings, click Appearance, and then click 'Default' under Theme.\n\nRemove this from Brave\nOpen Brave and go to brave://settings\nClick on Appearance\nNext to 'Theme' there should be a 'Reset to default' button. Click that and Brave's theme should have been reset \n\nHow did this get on my computer?\nThis theme is normally installed from the Chrome Web Store by the user of this browser.\n\nHopefully this helped you in some way. If you noticed an error, feel free to email me. My email is iam-py-test@protonmail.com.\n-- iam-py-test"
  }
  ]
