[
  {
    "title":"Introducing python-in-browser",
    "body":"Python-in-browser is a project I have been working on which allows you to run Python code in your browser, sandboxed away from your system.\n \nI was inspired by https://github.com/raxod502/python-in-a-box, but python-in-browser has very few things in common. \nPython-in-a-box runs Python code on a server, so it has access to most of the good Python featues.\nPython-in-browser parses Python code in your browser, so it lacks most of those features. \nThe only good thing about Python-in-browser is the fact that it sends no requests to a server, so it works offline. (to some degree, and the page must be loaded with an internet connection)\nPython-in-browser can be found at https://iam-py-test.github.io/python-in-browser, and the source code is at https://github.com/iam-py-test/python-in-browser",
	"hidden": true
  },
  {
    "title":"How to fix VirtualBox error 0x80004005",
    "hidden":true,
    "body":"If you have updated VirtualBox lately, you might have noticed that whenever you try to start a VM - even a new one - you get an error with the code 0x80004005.\nBut don't worry; your VMs are safe. There is a simple fix.\nAll you need to do is download version 6.1.26 from https://www.virtualbox.org/wiki/Download_Old_Builds_6_1 and install it.\nAfter that, you will get alerts telling you to update, but until it is fixed, you should ignore them.\nNote that version 6.1.30 is affected\nSmall note: While I was trying to fix this, I ran across a lot of weird 'fixes' which said to delete random folders, so be careful when looking for fixes on the internet.\nFor more information, please see https://forums.virtualbox.org/viewtopic.php?t=104228.\nHope this fixes your issue!"
  },
  {
    "title":"Removal instructions for \"Discord Free Nitro - Free Discord Nitro 2021\" ",
    "body":"\"Discord Free Nitro - Free Discord Nitro 2021\" is a theme for Chromium (Google Chrome, Microsoft Edge, Brave, Opera) browsers which appears to exist for the primary purpose of promoting a scam website which claims to give you Discord Nitro.\nWhile the theme does not seem harmful, you still may want to remove it.\n<h4>How to remove it from Google Chrome</h4>To remove this from Google Chrome, go to chrome://settings. In the sidebar, click Appearance.\nAt the top, it should say Theme. Click the \"Reset to default\" button next to that.\nYour browser should now be running the default theme.\n<h4>How to remove it from Microsoft Edge:</h4>To remove this theme from Microsoft Edge (and reset back the the default theme, where you can select a theme of your choice), go to edge://settings, click Appearance, and then click 'Default' under Theme.\n<h4>Remove this from Brave</h4>Open Brave and go to brave://settings\nClick on Appearance\nNext to 'Theme' there should be a 'Reset to default' button. Click that and Brave's theme should have been reset \n\nHow did this get on my computer?\nThis theme is normally installed from the Chrome Web Store.\n\nHopefully this helped you in some way. If you noticed an error, feel free to email me. My email is iam-py-test@protonmail.com.\n-- iam-py-test"
  },
  {
  "title":"How to remove Reimage Repair",
  "body":"Reimage Repair is a shady piece of software which claims to fix issues with your Windows computer. The company behind it uses scam-like tactics to promote their product, and after installed, it will try to convince you to buy it by showing fake issues with your computer.<br><img width='850' src=\"https://user-images.githubusercontent.com/84232764/157139690-c2d0a340-ba66-4d72-8299-926c02b4d06d.png\" alt='Reimage shows issues with a prefectly safe Windows 11 machine' title='Reimage shows issues with a prefectly safe Windows 11 machine'><br>I recommend people avoid installing Reimage. If you or someone you know has it installed, I will show how to remove it.<br>Before removing Reimage, save all of your work and close all applications. Be sure you close all Reimage windows as well (if they don't close, try rebooting).<br>First, let's try to uninstall Reimage using the Windows settings. \nIf you are using Windows 10, follow the instructions at <a href='https://support.microsoft.com/en-us/windows/uninstall-or-remove-apps-and-programs-in-windows-10-4b55f974-2cc6-2d2b-d092-5905080eaf98'>https://support.microsoft.com/en-us/windows/uninstall-or-remove-apps-and-programs-in-windows-10-4b55f974-2cc6-2d2b-d092-5905080eaf98</a>.<br> If you are using Windows 11, use this guide: <a href='https://www.howtogeek.com/749585/how-to-uninstall-an-application-on-windows-11/'>https://www.howtogeek.com/749585/how-to-uninstall-an-application-on-windows-11/</a>.<br> If you use another version of Windows, then you may need find instructions for that specific version.<br>\nIn the uninstaller, click <i>Remove</i>. Do not click <i>Remove but stay protected</i>.<br><img width='850' alt='Click \"Remove\" in the uninstaller' src='https://user-images.githubusercontent.com/84232764/157140369-c782e26d-490e-4e0e-8a4f-2e6162861d7b.png'><br>A website will open in your browser asking you to buy Reimage. Simply close the window and proceed with the removal.<br><img width='850' alt='Reimage opens a website while being uninstalled, asking you to buy it' src='https://user-images.githubusercontent.com/84232764/157142180-9f4e73c4-8373-4082-a324-a75398215458.png'><br>Reimage will ask why you are uninstalling it, and request your name and email. Just click 'Skip'.<br><img width='850' src='https://user-images.githubusercontent.com/84232764/157142779-94c8bcf1-bbf4-4fd1-a4ad-efd19e0420de.png' alt='Reimage wants you to say why you are uninstalling it, but you should click Skip'><br>Wait for the uninstall to complete, and then reboot your device.<br>Next, we need to remove any remaining traces using Malwarebytes's ADWCleaner. This is a free tool to remove adware and PUPs.<br>Go to ADWCleaner from <a href=\"https://malwarebytes.com/adwcleaner\">https://malwarebytes.com/adwcleaner</a> and click the 'Free download' button (direct download link: <a href='https://adwcleaner.malwarebytes.com/adwcleaner?channel=release'>https://adwcleaner.malwarebytes.com/adwcleaner?channel=release</a>). Once it is downloaded, go to the location where you saved it (probably C:\\Users\\[your username]\\Downloads) and click twice on the adwcleaner.exe file. You will need to click 'Yes' or enter your password in the prompt from Windows.<br>Once it is open, click 'Scan now' and wait for the scan to complete. You do not need to buy Malwarebytes Premium (their paid product).<br><img width='850' src='https://user-images.githubusercontent.com/84232764/157144961-7194aee6-ff45-4733-9a2d-5bb386fc583f.png'><br><img width='850' src='https://user-images.githubusercontent.com/84232764/157145042-0cbbb487-4be5-4bfe-a02f-4d456cf212d9.png'><br>Once the scan is complete, be sure to click 'Quarantine'.<br><img width='850' src='https://user-images.githubusercontent.com/84232764/157145167-c0cb24c9-f01e-42d4-9517-395959b6ffac.png'><br>If it asks if you want to continue, click 'Continue'<br><img width='850' src='https://user-images.githubusercontent.com/84232764/157145294-ed5e1c3f-77ab-400c-885d-a87a0faccd69.png' alt=\"A confirmation prompt saying all applications will be closed and warning the use to save all unsaved work\"><br>Once it is done, reboot your device.<br>If you need other help, if these steps don't remove Reimage, or if you notice an error, feel free to contact me. My email is iam-py-test@protonmail.com"
  }
  ]
