[
  {
    "title":"Test",
    "body":"This is an test.\nThis is another line of the test\n\nEven more lines\n\tA tab\n\nYou can email localhost at localhost@localhostmail.com"
  },
  {
    "title":"Introducing python-in-browser",
    "body":"Python-in-browser is a project I have been working on which allows you to run Python code in your browser, sandboxed away from your system.\n \nI was inspired by https://github.com/raxod502/python-in-a-box, but python-in-browser has very few things in common. \nPython-in-a-box runs Python code on a server, so it has access to most of the good Python featues.\nPython-in-browser parses Python code in your browser, so it lacks most of those features. \nThe only good thing about Python-in-browser is the fact that it sends no requests to a server, so it works offline. (to some degree, and the page must be loaded with an internet connection)\nPython-in-browser can be found at https://iam-py-test.github.io/python-in-browser, and the source code is at https://github.com/iam-py-test/python-in-browser"
  },
  {
    "title":"Why should you use NoScript?",
    "workinprogress":true,
    "body":"NoScript is a browser extention which allows you to selectivly allow or deny scripts. NoScript also provides protection against XSS (see https://en.wikipedia.org/wiki/xss), but I have never seen it block a real attack. \nHowever, its XSS protection was able to block all of the XSS tests I knew and all of the OWASP advanced ones I tested. "
  },
  {
    "title":"Tracking down fake Firefoxs",
    "workinprogress":true,
    "body":"The first results on a quick search 'Download firefox' are from Mozilla's website, but if you scroll down, there are a few other results that are not. \nSome of them seem legit, but others are a bit more suspicious. I clicked on the 9th result, and immediately it was blocked by the Blocklist Project malware (found here - https://raw.githubusercontent.com/blocklistproject/Lists/master/malware.txt) due to its root domain.\nVirusTotal shows three detections for it, but the root domain had 4 and a poor community rating. A comment from 5 years ago says \"It's just a breeding ground for viruses! \".\nNorton's community reports are all from 9 or more years ago, and is rated poorly.\nFinally, MyWOT has one community rating from 6 years ago that marks it as low trust, and the icon at the top is orange.\nAll the files from the domain were clean according to VT, but their SHA-256s are diffrent from the offical Firefox downloader.\n If someone knows anything about this domain, please reach out to me via https://github.com/iam-py-test/my_filters_001/issues.\nUntil more information is known, I will not blocklist this domain. However, if malitious \nDomains: mozilla-firefox[.]apponic[.]com\nmozilla-firefox-64-bit[.]apponic[.]com\nSHA-256:\n59feaae75bfee9454a5b1302c4a85926a24890cf55ddaabe17e2696936eeb944"
  },
  {
    "title":"Don't enable Macros; they can infect your computer",
    "body":"Microsoft Office macros are being abused to infect peoples computers with malware; the Dridex malware is spread primarly throught this, and this attack has been used many other times. Not all Macros are bad; many people use Macros for legit uses, and this makes fighting Macro viruses even harder.\nPlus, Macro viruses are hard to detect by antivirus scanners (1), and manual analysis is not a viable option.\nThe real responsibility for preventing this type of malware falls to Microsoft, who (as of May 17th) has failed to patch this. \nTo my knowlage, this exploit only effects Windows.\n\nWhat can you do about this:\n1. Do not open attachments from strange emails\n2. Do not enable Macros in emails or from other devices\nWhile you may think it is ok to run Macros from a trusted source, they could be infected (some people have been infected via emails from trusted sources) or the address could have been spoofed.\n3. Install an antivirus (even on MacOS)\nWhile antivirus software is not perfect, it can stop malware infections. I recommend https://malwarebytes.com, but any good antivirus should do. \nHowever, make sure your antivirus uses heuristics. Personally, I recommend against using McAfee.\n4. Keep your system and all software up-to-date\nThis is important, as security patches and antivirus updates can eliminate malware.\nNormally new Macro virus are detected soon, as the malware reported to https://www.joesandbox.com/analysis/413824/0/html now has 35 detections (https://www.virustotal.com/gui/file/692868392ecf930f456d9387ee6132eac61cc07913e668fe6af575f16fbb2392/detection)\n5. Don't use Windows\nThis exploit, and a lot of other malware, primarly or only attacks Windows. Even if you are using a secure OS, you still should follow the above steps.\n6. If you think you have been infected, immediately disconnect from the internet and (if possible) manually disable the router. \nThen run an antimalware scan on your device and all devices on that network. \nIf you think you were infected by an email from someone you trust, tell them to scan their system for malware.\nOn Windows, I recommend you scan using your antivirus and Windows Defender (full and offline scans). \nAlso download (via another computer if possible) Malwarebytes free (here - https://www.malwarebytes.com/), ADWCleaner (here - https://www.malwarebytes.com/adwcleaner), Malwarebytes antirootkit (beta) (here - https://www.malwarebytes.com/antirootkit), and Hitman Pro (here - https://secure2.sophos.com/en-us/products/free-tools/hitmanpro.aspx).\nLinks to more information:\nhttps://www.fortinet.com/blog/threat-research/hundreds-of-urls-inside-microsoft-excel-spreads-new-dridex-trojan-variant \nhttps://en.wikipedia.org/wiki/Macro_virus\nhttps://iam-py-test.github.io/security_research/reports.html#report-Exploit:Win64/msoffice.malwaredownload\n"
  }
  ]
